src/cf/Documents/ЗаявкаНаПродажуЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПродажуЦБ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеДСНаСчете</xr:Item>
				<xr:Item>AccumulationRegister.КомиссияБиржи</xr:Item>
				<xr:Item>AccumulationRegister.Прибыль</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеЦБ</xr:Item>
				<xr:Item>AccumulationRegister.КомиссияБрокера</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструмент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБВЛоте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ДвижениеДСНаСчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДвижениеДСНаСчете</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаСчетПрибыли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ДвижениеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДвижениеЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/КомиссияБрокера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>КомиссияБрокера</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/КомиссияБиржи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>КомиссияБиржи</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/Прибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Прибыль</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалогУдержан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаПродажуЦБ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//МассивЦб = Новый Массив;
	//МассивЦб = Инструменты.ВыгрузитьКолонку("Инструмент");  
	//СрСтоимостьПродаваемыхЦБ = Новый Соответствие;
	//СрСтоимостьПродаваемыхЦБ = ОбщийМодульРасчета.СредняяСтоимостьПродаваемыхЦБ(Ссылка); 
		
	Движения.ДвижениеДСНаСчете.Записывать = Истина;  
	Движения.ДвижениеЦБ.Записывать = Истина;
	Движения.КомиссияБрокера.Записывать = Истина;
    Движения.КомиссияБиржи.Записывать = Истина;
	Движения.Прибыль.Записывать = Истина;
	Движения.Записать();  
	
	// регистр ДвижениеДСНаСчете Расход
	Движения.ДвижениеДСНаСчете.Записывать = Истина;
	Движение = Движения.ДвижениеДСНаСчете.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.Сумма = СуммаДокумента;
	Движение.ЗаСчетПрибыли = Ложь;
	
	
	// регистр ДвижениеЦБ  и  Регистр прибыли 
	Движения.ДвижениеЦБ.Записывать = Истина;
	Движения.Прибыль.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДвижениеЦБ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("БрокерскийСчет",БрокерскийСчет);
	ЭлементБлокировки.ИсточникДанных = Инструменты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Инструмент","Инструмент");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПродажуЦБИнструменты.КоличествоЦБ КАК КоличествоЦБ,
		|	ЗаявкаНаПродажуЦБИнструменты.Инструмент КАК Инструмент,
		|	ЗаявкаНаПродажуЦБИнструменты.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТИнструменты
		|ИЗ
		|	Документ.ЗаявкаНаПродажуЦБ.Инструменты КАК ЗаявкаНаПродажуЦБИнструменты
		|ГДЕ
		|	ЗаявкаНаПродажуЦБИнструменты.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Инструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТИнструменты.КоличествоЦБ, 0) КАК КоличествоЦБ,
		|	ЕСТЬNULL(ДвижениеЦБОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ДвижениеЦБОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ВТИнструменты.Сумма, 0) КАК Сумма,
		|	ВТИнструменты.Инструмент КАК Инструмент
		|ИЗ
		|	ВТИнструменты КАК ВТИнструменты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеЦБ.Остатки(&МоментВремени, БрокерскийСчет = &БрокерскийСчет) КАК ДвижениеЦБОстатки
		|		ПО ВТИнструменты.Инструмент = ДвижениеЦБОстатки.Инструмент";
	
	Запрос.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоЦБ=Выборка.КоличествоОстаток Тогда   	
			СебеСтоимость = Выборка.СуммаОстаток;  	
		Иначе 
			СебеСтоимость = Выборка.СуммаОстаток*Выборка.КоличествоЦБ/Выборка.КоличествоОстаток; 
		КонецЕсли; 
	
		Движение = Движения.ДвижениеЦБ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = Выборка.Инструмент;
		Движение.Количество = Выборка.КоличествоЦБ;
		Движение.Сумма = СебеСтоимость;   
		
		/////  
		 
		Движение = Движения.Прибыль.Добавить();
		Прибыль = Выборка.Сумма - СебеСтоимость;
		Если Прибыль< 0 Тогда 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Прибыль = Прибыль * (-1);
		Иначе	                                         
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;	
	    Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Сумма = Прибыль;
		Движение.НалогУдержан = Ложь;			
	
	КонецЦикла;
	

	// регистр КомиссияБрокера Приход
	Движения.КомиссияБрокера.Записывать = Истина; 

	
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБрокера.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБрокера;
	КонецЦикла;
	
	// регистр КомиссияБиржи Приход
	Движения.КомиссияБиржи.Записывать = Истина;  
	
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.КомиссияБиржи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Сумма = ТекСтрокаИнструменты.СуммаКомиссииБиржи;
	КонецЦикла;
	
	  
	// Регистр прибыли
	//Движения.Прибыль.Записывать = Истина;
	//Для каждого ТекСтрокаИнструменты Из Инструменты Цикл 
	//	СрСтоимостьЦБ = СрСтоимостьПродаваемыхЦБ.Получить(ТекСтрокаИнструменты.Инструмент);
	//	Движение = Движения.Прибыль.Добавить();
	//	Прибыль = ТекСтрокаИнструменты.Сумма - (СрСтоимостьЦБ*ТекСтрокаИнструменты.КоличествоЦБ);
	//	Если Прибыль< 0 Тогда 
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	//		Прибыль = Прибыль * (-1);
	//	Иначе	                                         
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	КонецЕсли;	
	//    Движение.Период = Дата;
	//	Движение.БрокерскийСчет = БрокерскийСчет;
	//	Движение.Сумма = Прибыль;
	//	Движение.НалогУдержан = Ложь;		
	//КонецЦикла;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Инструменты.Итог("Сумма") 
					-  Инструменты.Итог("СуммаКомиссииБрокера")
					- Инструменты.Итог("СуммаКомиссииБиржи");
	
КонецПроцедуры
